package ru.netology;

//TIP To <b>Run</b> code, press <shortcut actionId="Run"/> or
// click the <icon src="AllIcons.Actions.Execute"/> icon in the gutter.
//public class Main {
//    public static void main(String[] args) {
//
//        /*
//         *создаем классы с названиями для задач
//         * заполняем входные данные
//         * создаем конструктор если нужно
//         * создаем геттеры и сеттеры если нужно
//         * создаем родительски класс от которого будем наследовать
//         * выносим в родительский класс то что есть общее в остальных классах
//         * наследуем родительский класс к другим классам
//         * создаем в менеджере единый масив в который мы сможем положить любую задачу
//         * проверяем вышесозданый масив тестом
//         * в Task заволим метод matches он будет решать подходи ли задача по запросу или нет
//         * в каждом наследнике переопределяем метод manches
//         * теперь можем добавить метод поиска в сам класс Todos */
//
//    }